:PROPERTIES:
:ID:       853a3bee-b823-49fc-acd6-804eecb74822
:ROAM_ALIASES: cpp标识符属性
:END:
#+title: C++标识符属性
#+filetags: cpp

* 存储期
:PROPERTIES:
:ID:       48f60537-4554-4d24-98fb-65f8a3bbbcf6
:END:
- 存储期 :: （ =运行时= ） *对象何时创建和销毁* ，分为：[[[https://cppreference.com/w/cpp/language/storage_duration.html][cppreference]]]
  + 自动存储期 :: 定义时 *创建* ，代码块结束时 *销毁* 。 *存储* 在 栈内存
  + 静态存储期 :: 程序开始时 *创建* （ =main()= 执行前），程序结束时 *销毁* 。 *存储* 在 .data（已初始化）或 .bss（未初始化）段
  + 动态存储期 :: 程序员手动创建和销毁（由 new 或 malloc *手动创建* ，delete 或 free *手动销毁* ）。 *存储* 在 堆内存
  + 线程存储期 :: 对象存储期和线程绑定


* 链接性
:PROPERTIES:
:ID:       2bb105a8-ced7-46d4-8e0b-90b0bf22139d
:END:
- 链接性 :: （ =链接时= ）标识符在多个文件之间的可见范围（局部变量无链接性），分为：[[[https://cppreference.com/w/cpp/language/storage_duration.html][cppreference]]]
  1. [[id:ec823c59-99d9-4818-a3a3-be1e01b55b3c][内部链接性]]
  2. [[id:eeb84412-f94b-4f43-b67a-d1063fb7e106][外部链接性]]


** 内部链接性
:PROPERTIES:
:ID:       ec823c59-99d9-4818-a3a3-be1e01b55b3c
:END:
- 内部链接性 :: 标识符只在当前文件可见，跨文件不可见（两个翻译单元中有同名标识符也不会冲突），有哪些？
  1. const/constexpr 全局变量
  2. static 全局变量 [fn:1]
  3. static 函数 [fn:2]
  4. 未命名命名空间内的内容


** 外部链接性
:PROPERTIES:
:ID:       eeb84412-f94b-4f43-b67a-d1063fb7e106
:END:
- 外部链接性 :: 标识符跨文件可见，有哪些？
  1. 函数
  2. 全局变量
  3. inline 全局变量（cpp17）
  4. extern const/constexpr 全局变量
  5. inline const/constexpr 全局变量


* 作用域
:PROPERTIES:
:ID:       86f59d1f-6578-439f-a686-bfa5507bc9b0
:END:
- 作用域 :: （ =编译时= ）标识符在单个文件内的可见范围，分为：
  1. 全局作用域
  2. 块作用域
  3. 类作用域
  4. [[id:604d5ad5-f060-4504-b407-933fc82aeb7e][命名空间]]作用域
  5. 枚举作用域（[[id:1d1d0bae-f9ec-40cb-98be-5f2c10b53258][作用域枚举]]）


* Footnotes
[fn:2]
#+name: add.cpp
#+begin_src cpp :results output :namespaces std :includes <iostream>
[[maybe_unused]] static int add(int x, int y) // add() 是 static的，具有内部链接性
{
    return x + y;
}
#+end_src

#+name: main.cpp
#+begin_src cpp :results output :namespaces std :includes <iostream>
int add(int x, int y); // 前向声明 add()
int main() {
    std::cout << add(3, 4) << '\n';
}
#+end_src

#+RESULTS:
: 编译错误，main.cpp 无法访问 add.cpp 中的 add()

[fn:1]
#+name: a.cpp
#+begin_src cpp :results output :namespaces std :includes <iostream>
[[maybe_unused]] constexpr int g_x { 2 }; // g_x 具有内部链接性，只能在 a.cpp 中访问
#+end_src

#+name: main.cpp
#+begin_src cpp :results output :namespaces std :includes <iostream>
static int g_x { 3 };  // g_x 具有内部链接性，只能在 main.cpp 中访问
const int g_y { 2 };   // const全局变量，只能在 main.cpp 中访问
constexpr int g_z {4}; // constexpr全局变量，只能在 main.cpp 中访问

int main() {
    std::cout << g_x << '\n';
}
#+end_src

#+RESULTS: main.cpp
: 3
